Messwerte/Archiv/Raw/apache_benchmark_repeat35/default/kata/httpd/target_count_21/repeat_14/8.txt
2020/01/29 03:33:56 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8008/
2020/01/29 03:34:26 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 12744 requests
Server Software:        Apache/2.4.41
Server Hostname:        192.168.3.100
Server Port:            8008
Document Path:          /
Document Length:        45 bytes
Concurrency Level:      100
Time taken for tests:   30.002 seconds
Complete requests:      12744
Failed requests:        0
Total transferred:      3683305 bytes
HTML transferred:       573525 bytes
Requests per second:    424.78 [#/sec] (mean)
Time per request:       235.418 [ms] (mean)
Time per request:       2.354 [ms] (mean, across all concurrent requests)
Transfer rate:          119.89 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   1.8      1      24
{"connect":{"max":24,"mean":2,"median":1,"min":0,"stdDev":1.7999999523162842},"percentiles":{"100":3648,"50":228,"66":264,"75":289,"80":311,"90":361,"95":405,"98":512,"99":626},"processing":{"max":3647,"mean":233,"median":226,"min":9,"stdDev":125.69999694824219},"total":{"max":3648,"mean":235,"median":228,"min":11,"stdDev":126},"waiting":{"max":3603,"mean":226,"median":224,"min":7,"stdDev":113.4000015258789}}
Processing:     9  233 125.7    226    3647
Waiting:        7  226 113.4    224    3603
Total:         11  235 126.0    228    3648
Percentage of the requests served within a certain time (ms)
  50%    228
  66%    264
  75%    289
  80%    311
  90%    361
  95%    405
  98%    512
  99%    626
 100%   3648 (longest request)
2020/01/29 03:34:26 Matched stat line [Connect:        0    2   1.8      1      24 Connect 0 2 1.8 1 24]
2020/01/29 03:34:26 Matched stat line [Processing:     9  233 125.7    226    3647 Processing 9 233 125.7 226 3647]
2020/01/29 03:34:26 Matched stat line [Waiting:        7  226 113.4    224    3603 Waiting 7 226 113.4 224 3603]
2020/01/29 03:34:26 Matched stat line [Total:         11  235 126.0    228    3648 Total 11 235 126.0 228 3648]
2020/01/29 03:34:26 Matched percentline [  50%    228 50 228]
2020/01/29 03:34:26 Matched percentline [  66%    264 66 264]
2020/01/29 03:34:26 Matched percentline [  75%    289 75 289]
2020/01/29 03:34:26 Matched percentline [  80%    311 80 311]
2020/01/29 03:34:26 Matched percentline [  90%    361 90 361]
2020/01/29 03:34:26 Matched percentline [  95%    405 95 405]
2020/01/29 03:34:26 Matched percentline [  98%    512 98 512]
2020/01/29 03:34:26 Matched percentline [  99%    626 99 626]
2020/01/29 03:34:26 Matched percentline [ 100%   3648 100 3648]